src/DataProcessors/ОтладкаВыгрузкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтладкаВыгрузкиЗагрузки</Name>
			<Comment>SD-86203</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогРазборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ОтладкаВыгрузкиЗагрузки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли; 
	    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьСценарийАвтономногоСервера(Объект.ИБ,Объект.Команда,
		Объект.КаталогРазборки, Объект.ИмяРасширения);  
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокРасширений(ИБ)
	
	Элемент_ИмяРасширения = Элементы.ИмяРасширения;
	
	Элемент_ИмяРасширения.СписокВыбора.Очистить();
	
	Если не ЗначениеЗаполнено(ИБ) Тогда
		Возврат;	
	КонецЕсли;  
	             
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_Хранилища.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы.Хранилище КАК ЗД_ИнформационныеБазыХранилище
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗД_Хранилища КАК ЗД_Хранилища
		|		ПО ЗД_ИнформационныеБазыХранилище.Хранилище = ЗД_Хранилища.Ссылка
		|ГДЕ
		|	ЗД_ИнформационныеБазыХранилище.Ссылка = &Ссылка
		|	И ЗД_Хранилища.ЭтоРасширение";
	
	Запрос.УстановитьПараметр("Ссылка", ИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Итератор = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элемент_ИмяРасширения.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование);					
		Итератор = Итератор+1;
	КонецЦикла;
	
	Элемент_ИмяРасширения.ПодсказкаВвода = СтрШаблон("%1 - Расширений",Итератор);	
	
КонецПроцедуры


&НаСервере
Процедура ИБПриИзмененииНаСервере()
	
	ЗаполнитьСписокРасширений(Объект.ИБ);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИБПриИзменении(Элемент)
	ИБПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ИБ) Тогда
		ЗаполнитьСписокРасширений(Объект.ИБ);	
	КонецЕсли; 
	
КонецПроцедуры
